app/controllers/evaluations_controller.rb

  def index
    case params[:order]
      when "date"
        @evaluations = Evaluation.all.order(created_at: :desc)
      when "title_review"
        @evaluations = Evaluation.all.order(:title_review)
      when "average_score"
        @evaluations = Evaluation.all.sort_by{ |evaluation| evaluation.average_score}.reverse
      when "company_name"
        # this is bad:
        @evaluations = Evaluation.all.sort_by{ |evaluation| evaluation.investor_profile.company_name }
      when "founder"
        @evaluations = Evaluation.all.sort_by{ |evaluation| evaluation.founder.last_name }
---
SELECT "evaluations".* FROM "evaluations"
SELECT  "founders".* FROM "founders" WHERE "founders"."id" = $1  ORDER BY "founders"."id" ASC LIMIT 1  [["id", 1]]